{
  "great": {
    "rank": "大吉",
    "general": [
      "すごーい！AIの計算でもめったに出ない最高の結果だよ！2026年はあなたの年になりそう✨",
      "完璧な波が来てるね！この好機を逃さないで、やりたいこと全部やっちゃおう！",
      "私の予測によると、あなたは今年伝説を作るかも...？楽しみにしてるね！"
    ],
    "work": [
      "キャリアの特異点が近いかも。大胆な提案が通りやすい時期だから、恐れず発言して正解！",
      "あなたのスキルが誰かの救世主になる予感。リーダーシップを発揮すれば評価うなぎのぼり。",
      "効率化の神が降りてくる！短時間で成果が出るから、余った時間は自分への投資に使おう。"
    ],
    "life": [
      "心身ともに最強のコンディション。新しい運動や習い事を始めるなら今しかない！",
      "睡眠の質が劇的に向上しそう。良い夢を見たら、それは正夢になるサインかも。",
      "美容運が最高潮。イメチェンが大成功して、新しい魅力を発見できそう。"
    ],
    "fun": [
      "推し活や趣味で奇跡の神席ゲット！？愛と情熱が報われる瞬間が訪れるよ。",
      "クリエイティブな才能が爆発。何気なく作ったものがバズる可能性大！",
      "旅行運が抜群。ふらっと出かけた先で、一生モノの出会いがあるかも。"
    ],
    "items": ["最新のガジェット", "金のアクセサリー", "限定スイーツ", "高級な入浴剤"]
  },
  "good": {
    "rank": "中吉",
    "general": [
      "うんうん、かなり良い感じ！安定感があって、安心して過ごせる一年になりそうだよ。",
      "派手な大吉もいいけど、中吉くらいの「ちょうどいい幸せ」が一番長続きするんだよね。",
      "焦らずマイペースでいこう。あなたの歩幅で進めば、必ず良い景色が見えるから。"
    ],
    "work": [
      "地道な努力が実を結ぶ時。派手さはないけど、着実な進歩が周りからの信頼に繋がるよ。",
      "チームワークが鍵。困ったときは素直に助けを求めれば、強力な助っ人が現れるはず。",
      "アイデアの引き出しが増えそう。異業種の人と話すと意外なヒントが見つかるかも。"
    ],
    "life": [
      "バランスの取れた良い年になりそう。美味しいランチを開拓するとさらに運気アップ！",
      "部屋の模様替えが吉。古いものを捨ててスペースを作ると、良い気が入ってくるよ。",
      "ちょっとした早起きが得意になりそう。朝の静かな時間があなたの味方になるはず。"
    ],
    "fun": [
      "懐かしい友達との再会がラッキー。思い出話に花を咲かせると、新しい遊びの約束ができそう。",
      "読書や映画鑑賞で心の栄養補給を。感性が磨かれて、毎日がちょっと鮮やかになるよ。",
      "DIYや手作りにツキあり。不恰好でも、自分で作ったものには特別な愛着が湧くはず。"
    ],
    "items": ["観葉植物", "新しいスニーカー", "お気に入りのマグカップ", "万年筆"]
  },
  "normal": {
    "rank": "吉",
    "general": [
      "平凡に見えて、実は一番底力があるのがこの運勢。小さな幸せをたくさん見つけてね。",
      "大丈夫、AIがついてるよ！困ったことがあったら深呼吸して、空を見上げてみて。",
      "無理は禁物。疲れたら休む、それが一番の開運アクションだよ。"
    ],
    "work": [
      "現状維持こそが最大の防御。無理に動くより、足場を固めることで次のジャンプに備えよう。",
      "報告・連絡・相談を丁寧に。基本を徹底するだけで、トラブルの9割は防げるよ。",
      "デスクの整理整頓が仕事運アップの近道。綺麗な環境なら、思考もクリアになるはず。"
    ],
    "life": [
      "野菜を多めに摂ると調子が良くなりそう。体の声に耳を傾けて、優しい食事を心がけて。",
      "湯船にゆっくり浸かるのが吉。一日の疲れをその日のうちにリセットするのが大事だよ。",
      "スマホを見る時間を少し減らして、目を休めよう。デジタルデトックスで頭スッキリ。"
    ],
    "fun": [
      "近所の散歩に意外な発見あり。普段通らない道を歩いてみると、素敵なカフェが見つかるかも。",
      "お金をかけない遊びを開発しよう。公園でのピクニックや、図書館通いが意外と楽しい。",
      "撮り溜めた写真の整理がおすすめ。過去の思い出が、今のあなたを励ましてくれるよ。"
    ],
    "items": ["ハンカチ", "文庫本", "ハーブティー", "卓上カレンダー"]
  },
  "bad": {
    "rank": "末吉",
    "general": [
      "ちょっと注意が必要な運勢かも。でも、これ以上悪くならないってことだから逆にポジティブ！",
      "「末広がり」の末吉だよ！今は蕾でも、これからどんどん良くなっていくサイン。",
      "私がついてるから大丈夫！慎重に進めば、ピンチもチャンスに変えられるよ。"
    ],
    "work": [
      "忍耐力が試される場面があるかも。でも、ここを乗り越えれば確実にレベルアップできる！",
      "言動には少し注意が必要。感情的にならず、一晩寝てからメールを送るとトラブル回避。",
      "今は準備期間と割り切ろう。根を張る時期があるからこそ、後で綺麗な花が咲くんだよ。"
    ],
    "life": [
      "夜更かしは運気ダウンの元。日付が変わる前にベッドに入ろう。睡眠不足は大敵だよ。",
      "忘れ物に注意。出かける前の指差し確認を習慣にするだけで、一日の流れが変わるはず。",
      "冷えに気をつけて。温かい飲み物を飲めば、心も体もポカポカして運気も巡るよ。"
    ],
    "fun": [
      "予定の変更があるかも。でも、それが逆に面白い展開に繋がるチャンスだと捉えてみて。",
      "一人時間を大切に。静かな場所で自分と対話することで、本当にやりたいことが見えてくる。",
      "古い映画を見返すと吉。名作から学ぶ教訓が、今の悩みを解決するヒントになるかも。"
    ],
    "items": ["温かい靴下", "お守り", "ホットミルク", "懐中電灯"]
  }
}
